Тест_ЗУП_31_КОРП/src/AccumulationRegisters/ДанныеОперативногоУчетаРабочегоВремениСотрудников/ДанныеОперативногоУчетаРабочегоВремениСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ДанныеОперативногоУчетаРабочегоВремениСотрудников</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Дни</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Часы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ПереходящаяЧастьПредыдущейСмены</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПереходящаяЧастьТекущейСмены</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Смена</name>
    <type>
      <types>CatalogRef.СменыРаботыСотрудников</types>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПериодРегистрации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидУчетаВремени</name>
    <type>
      <types>CatalogRef.ВидыИспользованияРабочегоВремени</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидДанных</name>
    <type>
      <types>EnumRef.ВидыДанныхУчетаВремениСотрудников</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Тест_ЗУП_31_КОРП/src/AccumulationRegisters/ДанныеОперативногоУчетаРабочегоВремениСотрудников/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция ОписаниеРегистра() Экспорт
	ОписаниеРегистра = УчетРабочегоВремениРасширенный.ОписаниеРегистраДанныхУчетаВремени();
	
	ОписаниеРегистра.МетаданныеРегистра = Метаданные.РегистрыНакопления.ДанныеОперативногоУчетаРабочегоВремениСотрудников;
	ОписаниеРегистра.ИмяПоляСотрудник = "Сотрудник";
	ОписаниеРегистра.ИмяПоляПериод = "Период";
	ОписаниеРегистра.ИмяПоляПериодРегистрации = "ПериодРегистрации";
	ОписаниеРегистра.ИмяПоляВидДанных = "ВидДанных";
	ОписаниеРегистра.ВидДанных = Неопределено;
	
	Возврат ОписаниеРегистра;
КонецФункции

#КонецЕсли
